<?php

class ClassConfig{


	public $_big_area;//地方
	public $_big_areas;//地方と都道府県の関連付け
	public $_areas;//都道府県
	public $_string_ja;//日本語関連
	public $_string_en;//英語関連

	public function __construct(){

	}

	//都道府県関連
	public function LocalAreas(){
		
		$this->_big_area = array( '1' => "北海道", '2' => "東北", '3' => "関東", '4' => "北陸信越", '5' => "東海"
								 ,'6' => "近畿", '7' => "中国", '8' => "四国", '9' => "九州"
								);
		
		$this->_big_areas = array( '1' => array( '1' => "北海道")
								  ,'2' => array( '2' => "青森県", '3' => "岩手県", '4' => "宮城県", '5' => "秋田県", '6' => "山形県", '7' => "福島県" )
								  ,'3' => array( '8' => "茨城県", '9' => "栃木県", '10' => "群馬県", '11' => "埼玉県", '12' => "千葉県", '13' => "東京都", '14' => "神奈川県", '19' => "山梨県" )
								  ,'4' => array( '15' => "新潟県", '16' => "富山県", '17' => "石川県", '18' => "福井県", '20' => "長野県" )
								  ,'5' => array( '21' => "岐阜県", '22' => "静岡県", '23' => "愛知県", '24' => "三重県" )
								  ,'6' => array( '25' => "滋賀県", '26' => "京都府", '27' => "大阪府", '28' => "兵庫県", '29' => "奈良県", '30' => "和歌山県" )
								  ,'7' => array( '31' => "鳥取県", '32' => "島根県", '33' => "岡山県", '34' => "広島県", '35' => "山口県" )
								  ,'8' => array( '36' => "徳島県", '37' => "香川県", '38' => "愛媛県", '39' => "高知県" )
								  ,'9' => array( '40' => "福岡県", '41' => "佐賀県", '42' => "長崎県", '43' => "熊本県", '44' => "大分県", '45' => "宮崎県", '46' => "鹿児島県", '47' => "沖縄県" )
								 );
		
		$this->_areas = array( '1' => "北海道", '2' => "青森県", '3' => "岩手県", '4' => "宮城県", '5' => "秋田県"
							  ,'6' => "山形県", '7' => "福島県", '8' => "茨城県", '9' => "栃木県", '10' => "群馬県"
                              ,'11' => "埼玉県", '12' => "千葉県", '13' => "東京都", '14' => "神奈川県", '15' => "新潟県"
                              ,'16' => "富山県", '17' => "石川県", '18' => "福井県", '19' => "山梨県", '20' => "長野県"
                              ,'21' => "岐阜県", '22' => "静岡県", '23' => "愛知県", '24' => "三重県", '25' => "滋賀県"
                              ,'26' => "京都府", '27' => "大阪府", '28' => "兵庫県", '29' => "奈良県", '30' => "和歌山県"
                              ,'31' => "鳥取県", '32' => "島根県", '33' => "岡山県", '34' => "広島県", '35' => "山口県"
                              ,'36' => "徳島県", '37' => "香川県", '38' => "愛媛県", '39' => "高知県", '40' => "福岡県"
                              ,'41' => "佐賀県", '42' => "長崎県", '43' => "熊本県", '44' => "大分県", '45' => "宮崎県"
                              ,'46' => "鹿児島県", '47' => "沖縄県"
                             );

	}
	
	//基本文字関連
	public function SetStringTurn(){

		$this->_string_ja = array( "あ" => array( "あ", "い", "う", "え", "お" )
								  ,"か" => array( "か", "き", "く", "け", "こ" )
								  ,"さ" => array( "さ", "し", "す", "せ", "そ" )
								  ,"た" => array( "た", "ち", "つ", "て", "と" )
								  ,"な" => array( "な", "に", "ぬ", "ね", "の" )
								  ,"は" => array( "は", "ひ", "ふ", "へ", "ほ" )
								  ,"ま" => array( "ま", "み", "む", "め", "も" )
								  ,"や" => array( "や", "ゆ", "よ" )
								  ,"ら" => array( "ら", "り", "る", "れ", "ろ" )
								  ,"わ" => array( "わ", "を", "ん" )
								 );

		$this->_string_en = array( 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z' );
	}
	
}


